# TypeSizeNotMatchWithHostError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPSupportFailures..::..TypeSizeNotMatchWithHostError Property
BuiltInFailures..::..MEPSupportFailures Class See Also
---
The [Symbol] does not match the size of the host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TypeSizeNotMatchWithHostError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TypeSizeNotMatchWithHostError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TypeSizeNotMatchWithHostError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPSupportFailures Class
Autodesk.Revit.DB Namespace